; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v3 - type_2 ?v8 - type_3)
 	      (pred_4 ?v6 - object ?v8 - type_3)
	      (pred_1 ?v3 - type_2 ?v4 - type_1)
	      (pred_2 ?v3 - type_2 ?v6 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v3 - type_2 ?v5 ?v7 - type_3)
       :precondition (and  (pred_3 ?v3 ?v5))
       :effect (and  (pred_3 ?v3 ?v7)
		     (not (pred_3 ?v3 ?v5))))

   (:action op_1
       :parameters (?v3 - type_2 ?v2 - object ?v1 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v1) (pred_3 ?v3 ?v1) (pred_1 ?v3 ?v4))
       :effect (and (pred_2 ?v3 ?v2 ?v4)
		    (not (pred_4 ?v2 ?v1)) 
		    (not (pred_1 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_2 ?v2 - object ?v1 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v2 ?v4) (pred_3 ?v3 ?v1))
       :effect (and (pred_4 ?v2 ?v1)
		    (pred_1 ?v3 ?v4)
		    (not (pred_2 ?v3 ?v2 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_11 - type_2
obj_14 obj_10 obj_05 obj_07 - type_1
obj_12 obj_02 obj_06 obj_01 - type_3
obj_03 obj_08 obj_09 obj_13 - object)
(:init
(pred_3 obj_04 obj_06)
(pred_1 obj_04 obj_14)
(pred_1 obj_04 obj_10)
(pred_3 obj_11 obj_01)
(pred_1 obj_11 obj_05)
(pred_1 obj_11 obj_07)
(pred_4 obj_03 obj_01)
(pred_4 obj_08 obj_12)
(pred_4 obj_09 obj_01)
(pred_4 obj_13 obj_06)
)
(:goal
(and
(pred_4 obj_03 obj_02)
(pred_4 obj_08 obj_02)
(pred_4 obj_09 obj_12)
(pred_4 obj_13 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_04 obj_01) (pred_3 obj_11 obj_01))))
  )
)
)

; plan
1. (op_1 obj_11 obj_09 obj_01 obj_07)
   deleted: (pred_4 obj_09 obj_01) (pred_1 obj_11 obj_07)
   added: (pred_2 obj_11 obj_09 obj_07)
   goals met: 0 of 4
2. (op_1 obj_11 obj_03 obj_01 obj_05)
   deleted: (pred_4 obj_03 obj_01) (pred_1 obj_11 obj_05)
   added: (pred_2 obj_11 obj_03 obj_05)
   goals met: 0 of 4
3. (op_1 obj_04 obj_13 obj_06 obj_10)
   deleted: (pred_4 obj_13 obj_06) (pred_1 obj_04 obj_10)
   added: (pred_2 obj_04 obj_13 obj_10)
   goals met: 0 of 4
4. (op_2 obj_11 obj_01 obj_02)
   deleted: (pred_3 obj_11 obj_01)
   added: (pred_3 obj_11 obj_02)
   goals met: 0 of 4
5. (op_2 obj_04 obj_06 obj_01)
   deleted: (pred_3 obj_04 obj_06)
   added: (pred_3 obj_04 obj_01)
   goals met: 0 of 4
6. (op_3 obj_04 obj_13 obj_01 obj_10)
   deleted: (pred_2 obj_04 obj_13 obj_10)
   added: (pred_4 obj_13 obj_01) (pred_1 obj_04 obj_10)
   goals met: 1 of 4
7. (op_3 obj_11 obj_03 obj_02 obj_05)
   deleted: (pred_2 obj_11 obj_03 obj_05)
   added: (pred_4 obj_03 obj_02) (pred_1 obj_11 obj_05)
   goals met: 2 of 4
8. (op_2 obj_11 obj_02 obj_12)
   deleted: (pred_3 obj_11 obj_02)
   added: (pred_3 obj_11 obj_12)
   goals met: 2 of 4
9. (op_2 obj_04 obj_01 obj_02)
   deleted: (pred_3 obj_04 obj_01)
   added: (pred_3 obj_04 obj_02)
   goals met: 2 of 4
10. (op_3 obj_11 obj_09 obj_12 obj_07)
   deleted: (pred_2 obj_11 obj_09 obj_07)
   added: (pred_4 obj_09 obj_12) (pred_1 obj_11 obj_07)
   goals met: 3 of 4
11. (op_1 obj_11 obj_08 obj_12 obj_05)
   deleted: (pred_4 obj_08 obj_12) (pred_1 obj_11 obj_05)
   added: (pred_2 obj_11 obj_08 obj_05)
   goals met: 3 of 4
12. (op_2 obj_11 obj_12 obj_02)
   deleted: (pred_3 obj_11 obj_12)
   added: (pred_3 obj_11 obj_02)
   goals met: 3 of 4
13. (op_3 obj_11 obj_08 obj_02 obj_05)
   deleted: (pred_2 obj_11 obj_08 obj_05)
   added: (pred_4 obj_08 obj_02) (pred_1 obj_11 obj_05)
   goals met: 4 of 4
